cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'

# shell utility
brew 'zsh'
brew 'zsh-completions'
brew 'ghq'
cask 'iterm2'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'peco'
brew 'hub'
brew  'z'
brew 'direnv'

# programming language
brew 'go'
brew 'rust'
brew 'haskell-stack'
brew 'python'
brew 'rbenv'
brew 'ruby-build'
brew 'java'
brew 'checkstyle'
brew 'spotbugs'
brew 'nodejs'

# editor
cask 'emacs'
cask 'visual-studio-code'

# mobile development
brew 'carthage'
cask 'android-studio'
brew 'bundletool'
brew 'ant'

# server developement
brew 'postgresql'
brew 'mysql'
brew 'heroku/brew/heroku'
brew 'wp-cli'
cask 'docker'
brew 'amazon-ecs-cli'

# misc
brew 'libidn'
brew 'jq'
brew 'awscli'
brew 'awsebcli'

# utility applications
cask 'firefox'
cask 'firefox-developer-edition'
cask 'firefox-nightly'
cask 'google-chrome'
cask 'slack'
cask 'skype'
cask 'zoom'

# fonts

brew 'font-hackgen'
brew 'font-hackgen-nerd'
