cask_args appdir: '/Applications'
tap 'caskroom/cask'
tap 'homebrew/cask-versions'

# shell utility
brew 'zsh'
brew 'zsh-completions'
brew 'ghq'
cask 'iterm2'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'peco'
brew 'hub'
brew  'z'
brew 'direnv'

# programming language
brew 'go'
brew 'rust'
brew 'haskell-stack'
brew 'python'
brew 'rbenv'
brew 'ruby-build'
cask 'java11'
brew 'checkstyle'
brew 'findbugs'
brew 'nodejs'

# editor
cask 'emacs'
brew 'cask'
cask 'visual-studio-code'

# mobile development
brew 'carthage'
brew 'blender/homebrew-tap/rome'
cask 'android-sdk'
cask 'android-studio'
brew 'bundletool'
brew 'ant'

# server developement
brew 'postgresql'
brew 'mysql'
brew 'heroku/brew/heroku'
brew 'wp-cli'
cask 'docker'
brew 'amazon-ecs-cli'

# misc
brew 'libidn'

# utility applications
cask 'firefox'
cask 'firefox-developer-edition'
cask 'firefox-nightly'
cask 'google-chrome'
cask 'slack'
cask 'skype'

# font
cask 'xquartz'
tap 'sanemat/font'
brew 'ricty', args: ['powerline']
