cask_args appdir: '/Applications'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# shell utility
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'ghq'
cask 'iterm2-nightly'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'peco'
brew 'gh'
brew 'z'

# programming language
brew 'java'
brew 'checkstyle'
brew 'spotbugs'
brew 'direnv'

# editor
cask 'emacs'
cask 'visual-studio-code'
tap 'dracula/install'
cask 'dracula-xcode'

# mobile development
cask 'android-studio'
brew 'bundletool'
brew 'firebase-cli'

# server developement
brew 'libpq'
brew 'mysql-client'
brew 'wp-cli'
cask 'docker'
brew 'awscli'
brew 'awsebcli'
brew 'amazon-ecs-cli'
brew 'vercel-cli'

# misc
brew 'libidn'
brew 'jq'
tap 'kardolus/chatgpt-cli'
brew 'chatgpt-cli'
brew 'ffmpeg'
brew 'pngquant'

# utility applications
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'stats'
cask 'slack'
cask 'zoom'
cask 'microsoft-teams'
cask 'spotify'
cask 'figma'
cask 'hammerspoon'

# fonts

cask 'font-hackgen'
cask 'font-hackgen-nerd'
